{
	"movies": [
		{
			"name": "Barfi!",
			"releaseDate": "2012-09-14",
			"actors": ["Ranbir Kapoor", "Priyanka Chopra", "Ileana D'Cruz"],
			"director": "Anurag Basu",
			"productionHouse": "UTV Motion Pictures",
			"genres": ["Comedy", "Drama", "Romance"],
			"boxofficeStatus": "Super Hit",
			"hints": [
				"A heartwarming tale of a charming deaf-mute boy and his relationships with two women.",
				"This film celebrates love, friendship, and the beauty of imperfections.",
				"It's set against a nostalgic backdrop of 1970s and 1980s India."
			],
			"easyHints": [
				"The protagonist's name is a nod to a popular sweet dish.",
				"The movie received acclaim for its performances and storytelling.",
				"It's known for its visually appealing cinematography.",
				"The story unfolds through a series of whimsical and touching moments."
			]
		},
		{
			"name": "Jab Tak Hai Jaan",
			"releaseDate": "2012-11-13",
			"actors": ["Shah Rukh Khan", "Katrina Kaif", "Anushka Sharma"],
			"director": "Yash Chopra",
			"productionHouse": "Yash Raj Films",
			"genres": ["Romance", "Drama"],
			"boxofficeStatus": "Hit",
			"hints": [
				"A romantic drama about a soldier with a tragic past and his complicated love life.",
				"This film explores themes of sacrifice, redemption, and second chances.",
				"It marks the final directorial venture of a Bollywood legend."
			],
			"easyHints": [
				"The movie's title translates to 'As long as I live'.",
				"It features picturesque locations from London to Ladakh.",
				"The story blends traditional romance with contemporary dilemmas.",
				"It received attention for its melodious soundtrack and emotional depth."
			]
		},
		{
			"name": "Ek Tha Tiger",
			"releaseDate": "2012-08-15",
			"actors": ["Salman Khan", "Katrina Kaif"],
			"director": "Kabir Khan",
			"productionHouse": "Yash Raj Films",
			"genres": ["Action", "Romance", "Thriller"],
			"boxofficeStatus": "Blockbuster",
			"hints": [
				"A high-octane action thriller about an Indian spy on a mission in Dublin.",
				"This film combines espionage with romance and breathtaking stunts.",
				"It explores the challenges of love across borders and conflicting loyalties."
			],
			"easyHints": [
				"The protagonist's code name is 'Tiger'.",
				"The movie features thrilling chase sequences and exotic locales.",
				"It was a commercial success known for its mass appeal.",
				"The story involves international intrigue and espionage."
			]
		},
		{
			"name": "Son of Sardaar",
			"releaseDate": "2012-11-13",
			"actors": ["Ajay Devgn", "Sonakshi Sinha", "Sanjay Dutt"],
			"director": "Ashwni Dhir",
			"productionHouse": "Viacom 18 Motion Pictures",
			"genres": ["Action", "Comedy", "Drama"],
			"boxofficeStatus": "Hit",
			"hints": [
				"A comedy-action film about a man returning to his ancestral village and facing old rivalries.",
				"This film blends humor, family drama, and a touch of romance.",
				"It celebrates the colorful culture and traditions of Punjab."
			],
			"easyHints": [
				"The protagonist's nickname is 'SOS'.",
				"The movie features iconic Punjabi dance sequences.",
				"It's known for its energetic performances and witty dialogues.",
				"The story revolves around misunderstandings and reconciliations."
			]
		},
		{
			"name": "Ek Main Aur Ekk Tu",
			"releaseDate": "2012-02-10",
			"actors": ["Imran Khan", "Kareena Kapoor"],
			"director": "Shakun Batra",
			"productionHouse": "Dharma Productions",
			"genres": ["Romance", "Comedy", "Drama"],
			"boxofficeStatus": "Average",
			"hints": [
				"A romantic comedy about two individuals with contrasting personalities on a journey of self-discovery.",
				"This film explores themes of friendship, love, and embracing life's uncertainties.",
				"It's set against the vibrant backdrop of Las Vegas and Mumbai."
			],
			"easyHints": [
				"The protagonists accidentally get married in Las Vegas.",
				"The movie received praise for its fresh take on relationships.",
				"It features a light-hearted narrative with emotional moments.",
				"The story captures the essence of modern-day urban relationships."
			]
		}
	]
}
